yearnext/ysf/bsp/stm32f1xx/map/map_uart.c
    LL_USART_DeInit(Uart[port]);
}

/**
 *******************************************************************************
 * @brief       uart port switch
 * @param       [in/out]  *config         device config block
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
__STATIC_INLINE
void _Uart_Port_Switch(uint8_t port, Hal_Device_Uart *drv)
{
    switch (port)
    {
#ifdef USART1
        case MCU_UART_1:
            if (drv->Config.Group == 0)
            {
                LL_GPIO_AF_DisableRemap_USART1();
            }
            else
            {
                LL_GPIO_AF_EnableRemap_USART1();
            }
            break;
#endif
            
#ifdef USART2
        case MCU_UART_2:
            if (drv->Config.Group == 0)
            {
                LL_GPIO_AF_DisableRemap_USART2();
            }
            else
            {
                LL_GPIO_AF_EnableRemap_USART2();
            }
            break;
#endif
            
#ifdef USART3
        case MCU_UART_3:
            if (drv->Config.Group == 0)
            {
                LL_GPIO_AF_DisableRemap_USART3();
            }
            else if (drv->Config.Group == 1)
            {
                LL_GPIO_AF_RemapPartial_USART3();
            }
            else
            {
                LL_GPIO_AF_EnableRemap_USART3();
            }
            break;
#endif
        default:
            break;
    }
}

/**
 *******************************************************************************
 * @brief       uart gpio init
 * @param       [in/out]  *config         set param
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
__STATIC_INLINE
void _Uart_GPIO_Init(uint8_t port, Hal_Device_Uart *drv)
{
    Hal_Device_GPIO txPort;
    Hal_Device_GPIO rxPort;

    txPort.Dir = GPIO_DIR_HS_OUTPUT;
    txPort.Mode = GPIO_AF_PUSH_PULL_MODE;

    rxPort.Dir = GPIO_DIR_INTPUT;
    rxPort.Mode = GPIO_FLOAT_MODE;
    
    switch (port)
    {
#ifdef USART1
        case MCU_UART_1:
            if (drv->Config.Group == 0)
            {
                txPort.Port = MCU_PORT_A;
                txPort.Pin  = MCU_PIN_9;
                
                rxPort.Port = MCU_PORT_A;  
                rxPort.Pin  = MCU_PIN_10;
            }
            else
            {
                txPort.Port = MCU_PORT_B;
                txPort.Pin  = MCU_PIN_6;
                
                rxPort.Port = MCU_PORT_B;  
                rxPort.Pin  = MCU_PIN_7;
            }
            break;
#endif
            
#ifdef USART2
        case MCU_UART_2:
            if (drv->Config.Group == 0)
            {
                txPort.Port = MCU_PORT_A;
                txPort.Pin  = MCU_PIN_2;
                
                rxPort.Port = MCU_PORT_A;  
                rxPort.Pin  = MCU_PIN_3;
            }
            else
            {
                txPort.Port = MCU_PORT_D;
                txPort.Pin  = MCU_PIN_5;
                
                rxPort.Port = MCU_PORT_D;  
                rxPort.Pin  = MCU_PIN_6;
            }
            break;
#endif
            
#ifdef USART3
        case MCU_UART_3:
            if (drv->Config.Group == 0)
            {
                txPort.Port = MCU_PORT_B;
                txPort.Pin  = MCU_PIN_10;
                
                rxPort.Port = MCU_PORT_B;  
                rxPort.Pin  = MCU_PIN_11;
            }
            else if (drv->Config.Group == 1)
            {
                txPort.Port = MCU_PORT_C;
                txPort.Pin  = MCU_PIN_10;
                
                rxPort.Port = MCU_PORT_C;  
                rxPort.Pin  = MCU_PIN_11;
            }
            else
            {
                txPort.Port = MCU_PORT_D;
                txPort.Pin  = MCU_PIN_8;
                
                rxPort.Port = MCU_PORT_D;  
                rxPort.Pin  = MCU_PIN_9;
            }
            break;
#endif
        default:
            break;
    }
    
    map_gpio_api.Open(txPort.Port);
    map_gpio_api.Init(txPort.Port, txPort.Pin, txPort.Dir, txPort.Mode);
    
    map_gpio_api.Open(rxPort.Port);
    map_gpio_api.Init(rxPort.Port, rxPort.Pin, rxPort.Dir, rxPort.Mode);
    
    _Uart_Port_Switch(port, drv);
}

/**
 *******************************************************************************
 * @brief       init uart
 * @param       [in/out]  port            uart id
 * @param       [in/out]  *config         set param
 * @return      [in/out]  HAL_ERR_NONE    set finish
 * @note        None
 *******************************************************************************
 */
void Map_Uart_Init(uint8_t port, void *param)
{
    hal_assert(IS_UART_PORT_INVAILD(port));
    hal_assert(IS_PTR_NULL(config));
    
    LL_USART_InitTypeDef LL_USART_InitStructure;
    Hal_Device_Uart *drv = (Hal_Device_Uart *)param;
    
    //< init uart gpio
    _Uart_GPIO_Init(port, drv);
    
    //< init uart baud rate
    LL_USART_InitStructure.BaudRate = drv->Config.Baud;
    
    //< init uart word len
    if(drv->Config.WordLen == MCU_UART_WORD_LEN_8B)
    {
        LL_USART_InitStructure.DataWidth = LL_USART_DATAWIDTH_8B;
    }
    else
    {
        LL_USART_InitStructure.DataWidth = LL_USART_DATAWIDTH_9B;
    }
    
    //< set uart stop bits
    if(drv->Config.StopBits == MCU_UART_STOP_BITS_0_5)
    {
        LL_USART_InitStructure.StopBits = LL_USART_STOPBITS_0_5;
    }
    else if(drv->Config.StopBits == MCU_UART_STOP_BITS_1)
    {
        LL_USART_InitStructure.StopBits = LL_USART_STOPBITS_1;
    }
    else if(drv->Config.StopBits == MCU_UART_STOP_BITS_1_5)
    {
        LL_USART_InitStructure.StopBits = LL_USART_STOPBITS_1_5;
    }
    else
    {
        LL_USART_InitStructure.StopBits = LL_USART_STOPBITS_2;
    }
    
    //< set uart parity
	if(drv->Config.Parity == MCU_UART_PARTY_NONE)
    {
        LL_USART_InitStructure.Parity = LL_USART_PARITY_NONE;
    }
    else if(drv->Config.Parity == MCU_UART_PARTY_EVEN)
    {
        LL_USART_InitStructure.Parity = LL_USART_PARITY_EVEN;
    }
    else
    {
        LL_USART_InitStructure.Parity = LL_USART_PARITY_ODD;
    }
    
    //< init uart mode
    LL_USART_InitStructure.TransferDirection = LL_USART_DIRECTION_NONE;

    //< set uart tx state
    if(drv->Config.TxConfig != MCU_UART_DISABLE_TX)
    {
        LL_USART_InitStructure.TransferDirection = LL_USART_DIRECTION_TX;
    }
    
    //< set uart rx state
    if(drv->Config.RxConfig != MCU_UART_DISABLE_RX)
    {
        LL_USART_InitStructure.TransferDirection |= LL_USART_DIRECTION_RX;
    }

    //< disable hardware flow control
    LL_USART_InitStructure.HardwareFlowControl = LL_USART_HWCONTROL_NONE;

    //< config uart call back
    UartTxCallback[port].Tx    = drv->TxCallback.Tx;
    UartTxCallback[port].Param = drv->TxCallback.Param;
    UartRxCallback[port].Rx    = drv->RxCallback.Rx;
    UartRxCallback[port].Param = drv->RxCallback.Param;
    
    //< init uart
    LL_USART_DeInit(Uart[port]);
    LL_USART_Init(Uart[port], &LL_USART_InitStructure);
    
