yearnext/ysf/bsp/stm32f1xx/map/map_uart.c
    if (Map_Uart_IsRxComplet(MCU_UART_4) == true)
    {
        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_4].Rx))
        {
            UartRxCallback[MCU_UART_4].Rx(UartRxCallback[MCU_UART_4].Param, Uart[MCU_UART_4]->DR);
        }
    }  
}
#endif

/**
 *******************************************************************************
 * @brief       uart5 isr handle
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
#ifdef UART5
void UART5_IRQHandler(void)
{
    if (Map_Uart_IsTxComplet(MCU_UART_5) == true)
    {
        if(!IS_PTR_NULL(UartTxCallback[MCU_UART_5].Tx))
        {
            UartTxCallback[MCU_UART_5].Tx(UartTxCallback[MCU_UART_5].Param);
        }
    }
    
    if (Map_Uart_IsRxComplet(MCU_UART_5) == true)
    {
        if(!IS_PTR_NULL(UartRxCallback[MCU_UART_5].Rx))
        {
            UartRxCallback[MCU_UART_5].Rx(UartRxCallback[MCU_UART_5].Param, Uart[MCU_UART_5]->DR);
        }
    }
}
#endif

#ifdef USE_HAL_UNIT_TEST
/**
 *******************************************************************************
 * @brief       hal uart unit test function
 * @param       [in/out]  void           
 * @return      [in/out]  void
 * @note        None
 *******************************************************************************
 */
void Hal_Uart_Test(void)
{
    Hal_Device_Uart uart = 
    {
        .Config.Port = MCU_UART_1,
        .Config.Baud = 115200,
        .Config.Parity = MCU_UART_PARTY_NONE,
        .Config.StopBits = MCU_UART_STOP_BITS_1,
        .Config.WordLen = MCU_UART_WORD_LEN_8B,

        .Config.RxConfig = MCU_UART_ENABLE_RX,
        .Config.TxConfig = MCU_UART_ENABLE_TX,
        
        .Config.Priority = 0x02,
    };
    
    uint16_t i;

    Hal_Uart_Init(&uart);

    while(1)
    {
        for(i=0; i<1000; i++);
        Hal_Uart_Send(&uart, 'A');
    }
}
#endif

/** @}*/     /** map uart component */

/**********************************END OF FILE*********************************/
